app/views/ranking/index.html.erb

<div class="row">
  <%= pie_chart  Gamer.group(:name).sum(:killings) %>
---
SELECT "gamers".* FROM "gamers"
SELECT SUM("gamers"."killings") AS sum_killings, name AS name FROM "gamers"  GROUP BY name

<div class="row">
  <%= pie_chart  Gamer.group(:name).sum(:deaths) %>
---
SELECT SUM("gamers"."deaths") AS sum_deaths, name AS name FROM "gamers"  GROUP BY name