app/controllers/ranking_controller.rb

  def destroy
    Gamer.delete_all
    Round.delete_all
---
DELETE FROM "gamers"
DELETE FROM "rounds"